espressif/arduino-esp32/boards.txt
##############################################################

onehorse32dev.name=Onehorse ESP32 Dev Module

onehorse32dev.upload.tool=esptool
onehorse32dev.upload.maximum_size=1310720
onehorse32dev.upload.maximum_data_size=294912
onehorse32dev.upload.wait_for_upload_port=true

onehorse32dev.serial.disableDTR=true
onehorse32dev.serial.disableRTS=true

onehorse32dev.build.mcu=esp32
onehorse32dev.build.core=esp32
onehorse32dev.build.variant=onehorse32dev
onehorse32dev.build.board=ONEHORSE_ESP32_DEV

onehorse32dev.build.f_cpu=240000000L
onehorse32dev.build.flash_mode=dout
onehorse32dev.build.flash_size=4MB

onehorse32dev.menu.FlashFreq.80=80MHz
onehorse32dev.menu.FlashFreq.80.build.flash_freq=80m
onehorse32dev.menu.FlashFreq.40=40MHz
onehorse32dev.menu.FlashFreq.40.build.flash_freq=40m

onehorse32dev.menu.UploadSpeed.921600=921600
onehorse32dev.menu.UploadSpeed.921600.upload.speed=921600
onehorse32dev.menu.UploadSpeed.115200=115200
onehorse32dev.menu.UploadSpeed.115200.upload.speed=115200
onehorse32dev.menu.UploadSpeed.256000.windows=256000
onehorse32dev.menu.UploadSpeed.256000.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400=230400
onehorse32dev.menu.UploadSpeed.230400.upload.speed=230400
onehorse32dev.menu.UploadSpeed.460800.linux=460800
onehorse32dev.menu.UploadSpeed.460800.macosx=460800
onehorse32dev.menu.UploadSpeed.460800.upload.speed=460800
onehorse32dev.menu.UploadSpeed.512000.windows=512000
onehorse32dev.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

featheresp32.name=Adafruit ESP32 Feather

featheresp32.upload.tool=esptool
featheresp32.upload.maximum_size=1310720
featheresp32.upload.maximum_data_size=294912
featheresp32.upload.wait_for_upload_port=true

featheresp32.serial.disableDTR=true
featheresp32.serial.disableRTS=true

featheresp32.build.mcu=esp32
featheresp32.build.core=esp32
featheresp32.build.variant=feather_esp32
featheresp32.build.board=FEATHER_ESP32

featheresp32.build.f_cpu=240000000L
featheresp32.build.flash_mode=dio
featheresp32.build.flash_size=4MB

featheresp32.menu.FlashFreq.80=80MHz
featheresp32.menu.FlashFreq.80.build.flash_freq=80m
featheresp32.menu.FlashFreq.40=40MHz
featheresp32.menu.FlashFreq.40.build.flash_freq=40m

featheresp32.menu.UploadSpeed.921600=921600
featheresp32.menu.UploadSpeed.921600.upload.speed=921600
featheresp32.menu.UploadSpeed.115200=115200
featheresp32.menu.UploadSpeed.115200.upload.speed=115200
featheresp32.menu.UploadSpeed.256000.windows=256000
featheresp32.menu.UploadSpeed.256000.upload.speed=256000
featheresp32.menu.UploadSpeed.230400.windows.upload.speed=256000
featheresp32.menu.UploadSpeed.230400=230400
featheresp32.menu.UploadSpeed.230400.upload.speed=230400
featheresp32.menu.UploadSpeed.460800.linux=460800
featheresp32.menu.UploadSpeed.460800.macosx=460800
featheresp32.menu.UploadSpeed.460800.upload.speed=460800
featheresp32.menu.UploadSpeed.512000.windows=512000
featheresp32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

nodemcu-32s.name=NodeMCU-32S

nodemcu-32s.upload.tool=esptool
nodemcu-32s.upload.maximum_size=1310720
nodemcu-32s.upload.maximum_data_size=294912
nodemcu-32s.upload.wait_for_upload_port=true

nodemcu-32s.serial.disableDTR=true
nodemcu-32s.serial.disableRTS=true

nodemcu-32s.build.mcu=esp32
nodemcu-32s.build.core=esp32
nodemcu-32s.build.variant=nodemcu-32s
nodemcu-32s.build.board=NodeMCU-32S

nodemcu-32s.build.f_cpu=240000000L
nodemcu-32s.build.flash_mode=dio
nodemcu-32s.build.flash_size=4MB

nodemcu-32s.menu.FlashFreq.80=80MHz
nodemcu-32s.menu.FlashFreq.80.build.flash_freq=80m
nodemcu-32s.menu.FlashFreq.40=40MHz
nodemcu-32s.menu.FlashFreq.40.build.flash_freq=40m

nodemcu-32s.menu.UploadSpeed.921600=921600
nodemcu-32s.menu.UploadSpeed.921600.upload.speed=921600
nodemcu-32s.menu.UploadSpeed.115200=115200
nodemcu-32s.menu.UploadSpeed.115200.upload.speed=115200
nodemcu-32s.menu.UploadSpeed.256000.windows=256000
nodemcu-32s.menu.UploadSpeed.256000.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400.windows.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400=230400
nodemcu-32s.menu.UploadSpeed.230400.upload.speed=230400
nodemcu-32s.menu.UploadSpeed.460800.linux=460800
nodemcu-32s.menu.UploadSpeed.460800.macosx=460800
nodemcu-32s.menu.UploadSpeed.460800.upload.speed=460800
nodemcu-32s.menu.UploadSpeed.512000.windows=512000
nodemcu-32s.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

MH-ET-LIVE-ESP32DevKIT.name=MH ET LIVE ESP32DevKIT

MH-ET-LIVE-ESP32DevKIT.upload.tool=esptool
MH-ET-LIVE-ESP32DevKIT.upload.maximum_size=1044464
MH-ET-LIVE-ESP32DevKIT.upload.maximum_data_size=294912
MH-ET-LIVE-ESP32DevKIT.upload.wait_for_upload_port=true

MH-ET-LIVE-ESP32DevKIT.serial.disableDTR=true
MH-ET-LIVE-ESP32DevKIT.serial.disableRTS=true

MH-ET-LIVE-ESP32DevKIT.build.mcu=esp32
MH-ET-LIVE-ESP32DevKIT.build.core=esp32
MH-ET-LIVE-ESP32DevKIT.build.variant=mhetesp32devkit
MH-ET-LIVE-ESP32DevKIT.build.board=MH-ET-LIVE-ESP32DevKIT

MH-ET-LIVE-ESP32DevKIT.build.f_cpu=240000000L
MH-ET-LIVE-ESP32DevKIT.build.flash_mode=dio
MH-ET-LIVE-ESP32DevKIT.build.flash_size=4MB

MH-ET-LIVE-ESP32DevKIT.menu.FlashFreq.80=80MHz
MH-ET-LIVE-ESP32DevKIT.menu.FlashFreq.80.build.flash_freq=80m
MH-ET-LIVE-ESP32DevKIT.menu.FlashFreq.40=40MHz
MH-ET-LIVE-ESP32DevKIT.menu.FlashFreq.40.build.flash_freq=40m

MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.921600=921600
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.921600.upload.speed=921600
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.115200=115200
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.115200.upload.speed=115200
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.256000.windows=256000
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.256000.upload.speed=256000
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.230400.windows.upload.speed=256000
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.230400=230400
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.230400.upload.speed=230400
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.460800.linux=460800
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.460800.macosx=460800
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.460800.upload.speed=460800
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.512000.windows=512000
MH-ET-LIVE-ESP32DevKIT.menu.UploadSpeed.512000.upload.speed=512000

