espressif/arduino-esp32/boards.txt
##############################################################

MH-ET-LIVE-ESP32MiniKit.name=MH ET LIVE ESP32MiniKit

MH-ET-LIVE-ESP32MiniKit.upload.tool=esptool
MH-ET-LIVE-ESP32MiniKit.upload.maximum_size=1044464
MH-ET-LIVE-ESP32MiniKit.upload.maximum_data_size=294912
MH-ET-LIVE-ESP32MiniKit.upload.wait_for_upload_port=true

MH-ET-LIVE-ESP32MiniKit.serial.disableDTR=true
MH-ET-LIVE-ESP32MiniKit.serial.disableRTS=true

MH-ET-LIVE-ESP32MiniKit.build.mcu=esp32
MH-ET-LIVE-ESP32MiniKit.build.core=esp32
MH-ET-LIVE-ESP32MiniKit.build.variant=mhetesp32minikit
MH-ET-LIVE-ESP32MiniKit.build.board=MH-ET-LIVE-ESP32MiniKit

MH-ET-LIVE-ESP32MiniKit.build.f_cpu=240000000L
MH-ET-LIVE-ESP32MiniKit.build.flash_mode=dio
MH-ET-LIVE-ESP32MiniKit.build.flash_size=4MB

MH-ET-LIVE-ESP32MiniKit.menu.FlashFreq.80=80MHz
MH-ET-LIVE-ESP32MiniKit.menu.FlashFreq.80.build.flash_freq=80m
MH-ET-LIVE-ESP32MiniKit.menu.FlashFreq.40=40MHz
MH-ET-LIVE-ESP32MiniKit.menu.FlashFreq.40.build.flash_freq=40m

MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.921600=921600
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.921600.upload.speed=921600
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.115200=115200
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.115200.upload.speed=115200
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.256000.windows=256000
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.256000.upload.speed=256000
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.230400.windows.upload.speed=256000
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.230400=230400
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.230400.upload.speed=230400
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.460800.linux=460800
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.460800.macosx=460800
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.460800.upload.speed=460800
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.512000.windows=512000
MH-ET-LIVE-ESP32MiniKit.menu.UploadSpeed.512000.upload.speed=512000

#################################################################

esp32vn-iot-uno.name=ESP32vn IoT Uno

esp32vn-iot-uno.upload.tool=esptool
esp32vn-iot-uno.upload.maximum_size=1044464
esp32vn-iot-uno.upload.maximum_data_size=294912
esp32vn-iot-uno.upload.wait_for_upload_port=true

esp32vn-iot-uno.serial.disableDTR=true
esp32vn-iot-uno.serial.disableRTS=true

esp32vn-iot-uno.build.mcu=esp32
esp32vn-iot-uno.build.core=esp32
esp32vn-iot-uno.build.variant=esp32vn-iot-uno
esp32vn-iot-uno.build.board=esp32vn-iot-uno

esp32vn-iot-uno.build.f_cpu=240000000L
esp32vn-iot-uno.build.flash_mode=dio
esp32vn-iot-uno.build.flash_size=4MB

esp32vn-iot-uno.menu.FlashFreq.80=80MHz
esp32vn-iot-uno.menu.FlashFreq.80.build.flash_freq=80m
esp32vn-iot-uno.menu.FlashFreq.40=40MHz
esp32vn-iot-uno.menu.FlashFreq.40.build.flash_freq=40m

esp32vn-iot-uno.menu.UploadSpeed.921600=921600
esp32vn-iot-uno.menu.UploadSpeed.921600.upload.speed=921600
esp32vn-iot-uno.menu.UploadSpeed.115200=115200
esp32vn-iot-uno.menu.UploadSpeed.115200.upload.speed=115200
esp32vn-iot-uno.menu.UploadSpeed.256000.windows=256000
esp32vn-iot-uno.menu.UploadSpeed.256000.upload.speed=256000
esp32vn-iot-uno.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32vn-iot-uno.menu.UploadSpeed.230400=230400
esp32vn-iot-uno.menu.UploadSpeed.230400.upload.speed=230400
esp32vn-iot-uno.menu.UploadSpeed.460800.linux=460800
esp32vn-iot-uno.menu.UploadSpeed.460800.macosx=460800
esp32vn-iot-uno.menu.UploadSpeed.460800.upload.speed=460800
esp32vn-iot-uno.menu.UploadSpeed.512000.windows=512000
esp32vn-iot-uno.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

esp32doit-devkit-v1.name=DOIT ESP32 DEVKIT V1

esp32doit-devkit-v1.upload.tool=esptool
esp32doit-devkit-v1.upload.maximum_size=1310720
esp32doit-devkit-v1.upload.maximum_data_size=294912
esp32doit-devkit-v1.upload.wait_for_upload_port=true

esp32doit-devkit-v1.serial.disableDTR=true
esp32doit-devkit-v1.serial.disableRTS=true

esp32doit-devkit-v1.build.mcu=esp32
esp32doit-devkit-v1.build.core=esp32
esp32doit-devkit-v1.build.variant=doitESP32devkitV1
esp32doit-devkit-v1.build.board=ESP32_DEV

esp32doit-devkit-v1.build.f_cpu=240000000L
esp32doit-devkit-v1.build.flash_mode=dio
esp32doit-devkit-v1.build.flash_size=4MB

esp32doit-devkit-v1.menu.FlashFreq.80=80MHz
esp32doit-devkit-v1.menu.FlashFreq.80.build.flash_freq=80m
esp32doit-devkit-v1.menu.FlashFreq.40=40MHz
esp32doit-devkit-v1.menu.FlashFreq.40.build.flash_freq=40m

esp32doit-devkit-v1.menu.UploadSpeed.921600=921600
esp32doit-devkit-v1.menu.UploadSpeed.921600.upload.speed=921600
esp32doit-devkit-v1.menu.UploadSpeed.115200=115200
esp32doit-devkit-v1.menu.UploadSpeed.115200.upload.speed=115200
esp32doit-devkit-v1.menu.UploadSpeed.256000.windows=256000
esp32doit-devkit-v1.menu.UploadSpeed.256000.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400=230400
esp32doit-devkit-v1.menu.UploadSpeed.230400.upload.speed=230400
esp32doit-devkit-v1.menu.UploadSpeed.460800.linux=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.macosx=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.upload.speed=460800
esp32doit-devkit-v1.menu.UploadSpeed.512000.windows=512000
esp32doit-devkit-v1.menu.UploadSpeed.512000.upload.speed=512000

esp32doit-devkit-v1.menu.DebugLevel.none=None
esp32doit-devkit-v1.menu.DebugLevel.none.build.code_debug=0
esp32doit-devkit-v1.menu.DebugLevel.error=Error
esp32doit-devkit-v1.menu.DebugLevel.error.build.code_debug=1
esp32doit-devkit-v1.menu.DebugLevel.warn=Warn
esp32doit-devkit-v1.menu.DebugLevel.warn.build.code_debug=2
esp32doit-devkit-v1.menu.DebugLevel.info=Info
esp32doit-devkit-v1.menu.DebugLevel.info.build.code_debug=3
esp32doit-devkit-v1.menu.DebugLevel.debug=Debug
esp32doit-devkit-v1.menu.DebugLevel.debug.build.code_debug=4

##############################################################

esp32-evb.name=OLIMEX ESP32-EVB

esp32-evb.upload.tool=esptool
esp32-evb.upload.maximum_size=1310720
esp32-evb.upload.maximum_data_size=294912
esp32-evb.upload.wait_for_upload_port=true

esp32-evb.serial.disableDTR=true
esp32-evb.serial.disableRTS=true

esp32-evb.build.mcu=esp32
esp32-evb.build.core=esp32
esp32-evb.build.variant=esp32-evb
esp32-evb.build.board=ESP32-EVB

esp32-evb.build.f_cpu=240000000L
esp32-evb.build.flash_mode=dio
esp32-evb.build.flash_size=4MB

esp32-evb.menu.FlashFreq.80=80MHz
esp32-evb.menu.FlashFreq.80.build.flash_freq=80m
esp32-evb.menu.FlashFreq.40=40MHz
esp32-evb.menu.FlashFreq.40.build.flash_freq=40m


esp32-evb.menu.UploadSpeed.115200=115200
esp32-evb.menu.UploadSpeed.115200.upload.speed=115200

##############################################################

esp32-gateway.name=OLIMEX ESP32-GATEWAY

esp32-gateway.upload.tool=esptool
esp32-gateway.upload.maximum_size=1310720
esp32-gateway.upload.maximum_data_size=294912
esp32-gateway.upload.wait_for_upload_port=true

esp32-gateway.serial.disableDTR=true
esp32-gateway.serial.disableRTS=true

esp32-gateway.build.mcu=esp32
esp32-gateway.build.core=esp32
esp32-gateway.build.variant=esp32-gateway
esp32-gateway.build.board=ESP32-GATEWAY

esp32-gateway.build.f_cpu=240000000L
esp32-gateway.build.flash_mode=dio
esp32-gateway.build.flash_size=4MB

esp32-gateway.menu.FlashFreq.80=80MHz
esp32-gateway.menu.FlashFreq.80.build.flash_freq=80m
esp32-gateway.menu.FlashFreq.40=40MHz
esp32-gateway.menu.FlashFreq.40.build.flash_freq=40m


esp32-gateway.menu.UploadSpeed.115200=115200
esp32-gateway.menu.UploadSpeed.115200.upload.speed=115200
